# Pandas

Pandas é uma biblioteca para gestão de dados, provendo funcionalidades para leitura de diversas estruturas de dados, bem como métodos para processamento e transformação dos dados. Além disso, provê gráficos para análise dos dados.

In [515]:
import numpy as np
import pandas as pd

## Série de dados

Uma série é como um array unidimensional indexado. E os índices podem também ser labels.

### Criando uma Série de dados

In [516]:
labels = ['a','b','c'] # lista de labels

lista = [10,20,30] # lista de valores

arr = np.array([10,20,30]) # array numpy

d = {'a':10,'b':20,'c':30} # dicionário de dados

#### Usando listas

In [517]:
pd.Series(data=lista)

0    10
1    20
2    30
dtype: int64

In [518]:
pd.Series(data=lista,index=labels)

a    10
b    20
c    30
dtype: int64

In [519]:
pd.Series(lista,labels)

a    10
b    20
c    30
dtype: int64

#### Usando numpy array

In [520]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [521]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

#### Usando dicionários

In [522]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

A Série de dados pode ser de qualquer tipo de valores

In [523]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

### Trabalhando com indíces

In [524]:
ser1 = pd.Series([2,2,3,4], index = ['USA', 'Germany','USSR', 'Japan'])

In [525]:
ser1

USA        2
Germany    2
USSR       3
Japan      4
dtype: int64

In [526]:
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany','Italy', 'Japan'])

In [527]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [528]:
ser1['USA']

2

Quando se opera com Séries, importante relacionar os indíces. Perceba que os indíces abaixo não existentes nas duas séries possuem valores "NaN"

In [529]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        3.0
USSR       NaN
dtype: float64

## Dataframe

Uma dataframe é uma estrutura de dados bidimensional semelhante há uma tabela e que permite fazer operações parecidas com sql sobre esta estrutura.

In [530]:
from numpy.random import randn

In [531]:
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns=['W','X','Y','Z'])

In [532]:
df

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056
E  1.364481  1.174498 -0.379644 -1.124235

In [533]:
df['W']

A    2.915658
B    1.233725
C    0.744529
D    0.023773
E    1.364481
Name: W, dtype: float64

In [534]:
df.W

A    2.915658
B    1.233725
C    0.744529
D    0.023773
E    1.364481
Name: W, dtype: float64

In [535]:
type(df['W'])

pandas.core.series.Series

In [536]:
df[['W','Z']]

          W         Z
A  2.915658 -0.036871
B  1.233725  1.055479
C  0.744529  0.826333
D  0.023773 -0.016056
E  1.364481 -1.124235

In [537]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

#### Criando uma nova coluna

In [538]:
df['nova'] = df['W'] + df['Y']

In [539]:
df

          W         X         Y         Z      nova
A  2.915658 -0.273267 -2.496079 -0.036871  0.419578
B  1.233725 -0.472878  0.211986  1.055479  1.445711
C  0.744529  1.016217  0.436330  0.826333  1.180858
D  0.023773 -0.778218  2.803836 -0.016056  2.827609
E  1.364481  1.174498 -0.379644 -1.124235  0.984838

#### Removendo coluna

In [540]:
df.drop('nova',axis=1) # Observe o atributo "axis = 1"

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056
E  1.364481  1.174498 -0.379644 -1.124235

In [541]:
# Perceba que ao imprimir o dataframe abaixo a coluna não foi removida de fato. 
df

          W         X         Y         Z      nova
A  2.915658 -0.273267 -2.496079 -0.036871  0.419578
B  1.233725 -0.472878  0.211986  1.055479  1.445711
C  0.744529  1.016217  0.436330  0.826333  1.180858
D  0.023773 -0.778218  2.803836 -0.016056  2.827609
E  1.364481  1.174498 -0.379644 -1.124235  0.984838

In [542]:
# Apenas com o "inplace" é que, de fato, removemos a coluna do dataframe em questão. Mas e o que aconteceu na célula anterior?
df.drop('nova', axis=1, inplace=True)

In [543]:
df

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056
E  1.364481  1.174498 -0.379644 -1.124235

Podemos então remover uma linha:

In [544]:
df.drop('E',axis=0) # Repare no valor do "axis = 0" novamente

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056

#### Selecionando linha

In [545]:
df.loc['A'] # Baseado no label

W    2.915658
X   -0.273267
Y   -2.496079
Z   -0.036871
Name: A, dtype: float64

Ou então baseado em posição da linha:

In [546]:
df.iloc[0]

W    2.915658
X   -0.273267
Y   -2.496079
Z   -0.036871
Name: A, dtype: float64

#### Selecionando um subconjunto de linhas e colunas

In [547]:
df.loc['A','Y']

-2.496079496144218

In [548]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.915658 -2.496079
B  1.233725  0.211986

### Seleção condicional

In [549]:
df

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056
E  1.364481  1.174498 -0.379644 -1.124235

In [550]:
df>0

      W      X      Y      Z
A  True  False  False  False
B  True  False   True   True
C  True   True   True   True
D  True  False   True  False
E  True   True  False  False

In [551]:
df[df>0]

          W         X         Y         Z
A  2.915658       NaN       NaN       NaN
B  1.233725       NaN  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773       NaN  2.803836       NaN
E  1.364481  1.174498       NaN       NaN

In [552]:
df['W']>0

A    True
B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [553]:
df[df['W']>0]

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056
E  1.364481  1.174498 -0.379644 -1.124235

In [554]:
df[df['W']>0]['Y']

A   -2.496079
B    0.211986
C    0.436330
D    2.803836
E   -0.379644
Name: Y, dtype: float64

In [555]:
df[df['W']>0][['Y','X']]

          Y         X
A -2.496079 -0.273267
B  0.211986 -0.472878
C  0.436330  1.016217
D  2.803836 -0.778218
E -0.379644  1.174498

Para mais de uma condição, podemos utilizar &  (AND) e | (OR)

In [556]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
D  0.023773 -0.778218  2.803836 -0.016056

## Operações de indíce

In [557]:
df

          W         X         Y         Z
A  2.915658 -0.273267 -2.496079 -0.036871
B  1.233725 -0.472878  0.211986  1.055479
C  0.744529  1.016217  0.436330  0.826333
D  0.023773 -0.778218  2.803836 -0.016056
E  1.364481  1.174498 -0.379644 -1.124235

In [558]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.915658 -0.273267 -2.496079 -0.036871
1     B  1.233725 -0.472878  0.211986  1.055479
2     C  0.744529  1.016217  0.436330  0.826333
3     D  0.023773 -0.778218  2.803836 -0.016056
4     E  1.364481  1.174498 -0.379644 -1.124235

In [559]:
newind = 'CA NY WY OR CO'.split()

In [560]:
df['States'] = newind

In [561]:
df

          W         X         Y         Z States
A  2.915658 -0.273267 -2.496079 -0.036871     CA
B  1.233725 -0.472878  0.211986  1.055479     NY
C  0.744529  1.016217  0.436330  0.826333     WY
D  0.023773 -0.778218  2.803836 -0.016056     OR
E  1.364481  1.174498 -0.379644 -1.124235     CO

In [562]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.915658 -0.273267 -2.496079 -0.036871
NY      1.233725 -0.472878  0.211986  1.055479
WY      0.744529  1.016217  0.436330  0.826333
OR      0.023773 -0.778218  2.803836 -0.016056
CO      1.364481  1.174498 -0.379644 -1.124235

In [563]:
df

          W         X         Y         Z States
A  2.915658 -0.273267 -2.496079 -0.036871     CA
B  1.233725 -0.472878  0.211986  1.055479     NY
C  0.744529  1.016217  0.436330  0.826333     WY
D  0.023773 -0.778218  2.803836 -0.016056     OR
E  1.364481  1.174498 -0.379644 -1.124235     CO

In [564]:
df.set_index('States',inplace=True)

In [565]:
df

               W         X         Y         Z
States
CA      2.915658 -0.273267 -2.496079 -0.036871
NY      1.233725 -0.472878  0.211986  1.055479
WY      0.744529  1.016217  0.436330  0.826333
OR      0.023773 -0.778218  2.803836 -0.016056
CO      1.364481  1.174498 -0.379644 -1.124235

# Groupby
Para quem conhece SQL, perceberá que funciona de maneira semelhante. Portanto, a ideia é agrupar valores semelhantes de maneira que se possa aplicar funções agregadoras.

In [566]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]} # Cria um dicionário

In [567]:
df = pd.DataFrame(data)

In [568]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

#### Agora vamos aplicar o groupby para identificar alguns valores sobre grupos

In [569]:
df.groupby('Company')

Perceba que ele retorna um objeto. Com ele poderemos aplicar as funções de agregação.

In [570]:
by_comp = df.groupby("Company")

Vamos obter a média por "Company"

In [571]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [572]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

O desvio padrão

In [573]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [574]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [575]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [576]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [577]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

## Merging, Joining e Concatenação

In [578]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [579]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [580]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [581]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [582]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [583]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenação
Concatenar significa basicamente juntar os valores. Importante destacar que os dataframes precisam ter a mesma dimensão.

In [584]:
pd.concat([df1,df2,df3]) # concatenando em linha

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [585]:
pd.concat([df1,df2,df3],axis=1) # concatenando em coluna

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
Semelhante à função SQL, é possível unir as colunas baseadas em uma chave

In [586]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C3', 'C4'],
                          'D': ['D0', 'D1', 'D2', 'D3', 'D4']})

In [587]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [588]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
4  K4  C4  D4

In [589]:
pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Joining
Semelhante ao Merge, une as colunas com base no critério. Contudo, a chave aqui é o indíce dos dataframes, sendo unificados mesmo quando os indíces não existem mutuamente.

In [590]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [591]:
left.join(right) # how='left' por padrão

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [592]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operações

In [617]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Valores únicos

In [594]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [595]:
df['col2'].nunique()

3

In [596]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Aplicando funções

In [597]:
def times2(x):
    return x*2

In [598]:
df['col1'].apply(times2) # df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [599]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [600]:
df['col1'].sum()

10

#### Removendo coluna

In [601]:
del df['col1'] # ou df.drop('col1',axis=1, inplace=True)

In [602]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Lista de colunas do dataframe

In [603]:
df.columns

Index(['col2', 'col3'], dtype='object')

#### Ordenando o dataframe

In [604]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [605]:
df.sort_values(by='col2') #inplace=False por padrão

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

#### Verificando valores nulos

In [606]:
df.isnull() # df.notnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

#### Removendo valores NaN

In [607]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

#### Preenchendo valores NaN

In [608]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [609]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [610]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [611]:
df.loc[0] = 1

In [612]:
df

     A    B  C  D
0    1    1  1  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Entrada e Saída de dados

## CSV

### CSV Input

In [613]:
df = pd.read_csv('Salaries.csv')
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### CSV Output

In [615]:
df.head(10).to_csv('test_salaries.csv',index=False)

In [616]:
df = pd.read_csv('test_salaries.csv')
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN